Repository: xccui/SPWAF-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: The file‐ system source connector provides only at-least-once guarantees when checkpointing is enabled if the FileInputFormat does not implement the CheckpointableInputFor mat interface because the input format will start reading from the beginning of the split that was processed when the last complete checkpoint was taken.
zh_cn: 如果FileInputFormat没有实现CheckpointableInputFormat接口，则文件系统数据源连接器在启用检查点的情况下只能提供至少一次保障，因为InputFormat会从划分的起点，也就是上一次成功生成检查点时的处理位置，开始读取数据。

source: The filter transformation drops or forwards events of a stream by evaluating a boolean condition on each input event.
zh_cn: Filter转换利用一个作用在每条输入事件上的布尔条件来决定流中事件的去存：

source: The first argument defines the topics to read from.
zh_cn: 第一个参数是要读取的主题，

source: The first field is a list of the flatMap results, and the second field is the new value of the state.
zh_cn: 其中第一个字段是flatMap的结果列表，第二个字段是新的状态值。

source: The first field of the SensorReading is a sensorId, the second field is the time‐ stamp in milliseconds since 1970-01-01-00:00:00.000, and the third field is an average temperature computed over 5 seconds.
zh_cn: SensorReading的第一个字段是sensorId，第二个字段是用自1970-01-01-00:00:00.000以来的毫秒数所表示的时间戳，第三个字段是每隔5秒计算出的平均温度。

source: The first field of the tuple holds the input record to flatMap, and the second field holds an Option of the retrieved state for the key of the processed record.
zh_cn: 参数元组的第一个字段是flatMap的输入记录；第二个字段是一个Option对象，其中保存了针对当前记录键值的状态。

source: The first generation of distributed open source stream processors (2011) focused on event processing with millisecond latencies and provided guarantees against loss of events in the case of failures.
zh_cn: 第一代开源分布式流处理引擎（2011年）专注于以毫秒级延迟处理数据并保证系统故障时事件不会丢失。

source: The first generation of distributed open source stream processors (2011) that got sub‐ stantial adoption focused on event processing with millisecond latencies and pro‐ vided guarantees that events would never be lost in case of a failure.
zh_cn: 第一代开源分布式流处理引擎（2011年）专注于以毫秒级延迟处理数据并保证系统出错时事件不会丢失。

source: The first interface defines assigners that emit watermarks periodically while the second injects watermarks
zh_cn: 前者定义的分配器会周期性地发出水位线，而后者会根据输入事件的属性来生成水位线。

source: The first parameter is a comma-separated string of Kafka broker addresses.
zh_cn: 第一个参数是英文逗号分隔的Kafka Broker地址字符串。

source: The first parameter is the input record and the second parameter is a callback object to return
zh_cn: 第一个参数是输入记录，

source: The first thing a Flink application needs to do is set up its execution environment.
zh_cn: Flink应用要做的第一件事就是设置执行环境。

source: The first type are periodic report queries that compute business relevant statistics such as revenue, user growth, or production output.
zh_cn: 第一类是定期报告查询，用于计算业务相关的统计信息，如收入、用户增长、产出等，

source: The fixed-delay restart strategy restarts an application a fixed number of times and waits a configured time before a restart attempt.
zh_cn: fixed-delay重启策略会以配置的固定间隔尝试将应用重启某个固定次数。

source: The flatMap transformation applies a function on each incoming event.
zh_cn: flatMap转换会针对每个到来事件应用一个函数。

source: The flatMap transformation is similar to map, but it can produce zero, one, or more output events for each incoming event.
zh_cn: flatMap转换类似于map，但它可以对每个到来事件产生零个、一个或多个输出事件。

source: The flatMapWithState() method expects a function that accepts a Tuple2.
zh_cn: 调用flatMapWithState()方法时需要提供一个参数为Tuple2的函数。

source: The folder contains a file flink-scala-project-0.1.jar, which is the JAR file of your Flink application.
zh_cn: 该文件夹里会有一个flink-scala-project-0.1.jar文件，也就是你Flink应用打成的JAR包。

source: The following code declares the id field as the key of a stream of SensorReading records:
zh_cn: 以下代码针对SensorReading记录流将其中的id字段声明为键值：

source: The following code shows how to apply a KeyedProcessFunction to a KeyedStream.
zh_cn: 以下代码展示了如何在一个KeyedStream上面使用KeyedProcessFunction。

source: The following code shows how to define a window operator with a custom trigger and evictor:
zh_cn: 以下代码展示了如何使用自定义触发器和移除器来定义窗口算子。

source: The following code shows how to define event-time and processing-time tumbling windows on a stream of sensor data measurements:
zh_cn: 以下代码展示了如何在一个传感数据测量流上定义事件时间和处理时间滚动窗口：

source: The following code shows how to group the sensor readings in sliding windows of 1 hour size with a 15-minute slide interval.
zh_cn: 以下代码展示了如何将传感器读数按照大小为1小时、滑动间隔为15分钟的滑动窗口进行分组。

source: The following code shows how to specify a window assigner and a window function on a keyed or nonkeyed stream:
zh_cn: 以下代码展示了如何在一个键值分区或非键值分区流上指定窗口分配器和窗口函数：

source: The following code shows the depend‐ ency you need to add to the build file of your application in order to use the Cassan‐ dra sink connector:
zh_cn: 为了在应用中使用Cassandra数据汇连接器，你需要在你的应用构建文件中添加以下依赖：

source: The following code shows the interface of the ProcessWindowFunction:
zh_cn: 以下代码展示了ProcessWindowFunction接口：

source: The following code shows win‐ dows with an offset of 15 minutes that start at 00:15:00, 01:15:00, 02:15:00, and so on:
zh_cn: 以下代码展示了偏移量为15分钟的窗口，它们将从00:15:00、01:15:00、02:15:00……时间点开始：

source: The following example code shows how to use the methods of a RichFlat MapFunction.
zh_cn: 示例5-3展示了如何使用RichFlatMapFunction中的方法。

source: The following example fil‐ ters a DataStream of tuples with two fields:
zh_cn: 以下示例展示了如何对一个双字段元组的DataStream进行过滤处理：

source: The following example keys the input stream by the second field of the input tuple:
zh_cn: 下方示例以输入元组的第二个字段作为输入流的键值：

source: The following example show a lambda function that filters tweets contain‐ ing the word “flink”:
zh_cn: 下面示例中的Lambda函数会过滤出所有包含"flink"一词的推文：

source: The following example shows a MapFunction that provides its return type:
zh_cn: 下面的例子展示了一个提供返回类型的MapFunction：

source: The following example shows a filter that drops all sensor measurements with tem‐ perature below 25°F:
zh_cn: 下方例子所展示的filter会丢弃所有温度低于25°F的传感器测量值：

source: The following example shows how to update a field of a Java tuple:
zh_cn: 下面的例子展示了如何对Java元组的字段进行更新：

source: The following examples show how to group the sensor readings into session windows where each session is defined by a 15-minute period of inactivity:
zh_cn: 以下示例展示了如何将传感器读数按照会话窗口进行分组，其中每个会话的非活动时间都设置为15分钟：

source: The following expression accesses the field of a tuple nested in a POJO:
zh_cn: 下方表达式用于访问嵌套在POJO中某一元组的字段：

source: The following is a simple mapper that extracts the first field (id) of each SensorRead ing in the input stream:
zh_cn: 下方展示的是一个简单的映射器，它会提取输入流中的每个SensorReading记录的第一个字段（id）。

source: The following shows how to generate watermarks
zh_cn: 下方展示了如何针对递增时间戳生成水位线：

source: The following shows how to union three streams of type SensorReading into a single stream:
zh_cn: 以下示例展示了如何将三条类型为SensorReading的数据流合并为一条：

source: The following shows the WindowAssigner interface:
zh_cn: 以下展示的就是WindowAssigner接口：

source: The following state primitives are supported by Flink:
zh_cn: Flink目前支持以下状态原语：

source: The follow‐ ing code shows the interface of the AggregateFunction:
zh_cn: 以下代码展示了AggregateFunction的接口：

source: The fol‐ lowing code shows how to use this shortcut:
zh_cn: 以下代码展示了如何使用这种简写：

source: The fol‐ lowing steps show you how to start a local Flink cluster and submit an application for execution.
zh_cn: 启动本地Flink集群并提交应用到上面执行的步骤如下：

source: The forward and random strategies as key-based
zh_cn: 转发和随机策略同样基于键值

source: The forward strategy and the random strategy can also be viewed as variations of the key-based strategy, where the first preserves the key of the upstream tuple while the latter performs a random re-assignment of keys.
zh_cn: 转发策略和随机策略也可以看做基于键值策略的变种，前者保留了上游元组的键值，后者会随机分配键值。

source: The framework style follows the traditional approach of submitting an application (or query) via a client to a running service.
zh_cn: 基于框架的模式采用的是传统方式，即通过客户端提交应用（或查询）到正在运行的服务上；

source: The framework style is follows the traditional approach of submitting an application (or query) via a client to a running service.
zh_cn: 基于框架的模式遵循传统方式，即通过客户端提交应用（或查询）到正在运行的服务上；

source: The function also returns a Tuple2.
zh_cn: 该函数同样会返回一个Tuple2对象。

source: The function can be specified with a class that implements the ReduceFunction inter‐ face.
zh_cn: 我们可以通过实现ReduceFunction接口来指定一个reduce函数。

source: The function in the above example counts per parallel instance how many tempera‐ ture measurements exceeded a configured threshold.
zh_cn: 上述例子中的函数会统计每个并行实例中超过阈值的温度值数目。

source: The function interface defines the transformation method that needs to be imple‐ mented by the user, such as the map() method in the example above.
zh_cn: 函数接口规定了用户需要实现的转换方法，例如上例中的map()方法。

source: The function is also properly integrated with Flink’s checkpointing mechanism—input records that are currently waiting for a response are checkpointed and queries are repeated in the
zh_cn: AsyncFunction还与Flink的检查点机制进行了良好的集成，所有正在等待响应的输入记录都会被写入检查点并支持在恢复时重新发送请求。

source: The function is applied on a stream of sentences, splits each sentence by the space character, and emits each resulting word as an individual record:
zh_cn: 这个函数会作用于一个语句流上，将每个语句按照空格字符分割，然后把分割得到的每个单词作为一条独立的记录发出去：

source: The function is called for each record of the stream and returns zero, one, or more records.
zh_cn: 该函数会针对流中的每条记录调用一次，并返回零个、一个或多个记录。

source: The function monitors the temperatures of sensors and emits a warning if the tem‐
zh_cn: 该函数对传感器温度进行监测，

source: The function that applies the rules ingests two input streams, the event stream and the rules stream.
zh_cn: 规则应用函数需要同时接收这两条输入流。

source: The function uses operator state and has a single state variable for each parallel operator instance that is checkpointed
zh_cn: 它其中用到了算子状态，该状态会为每个并行算子实例保存一个状态变量并通过ListCheckpointed接口定义的方法创建检查点和进行恢复。

source: The functions encapsulate the user application logic and define how the elements of the input stream are transformed into the elements of the output stream.
zh_cn: 这些函数封装了用户应用逻辑，定义了输入流的元素如何转换为输出流的元素。

source: The functions of the operators are fused into a single task that is executed by a single thread.
zh_cn: 多个算子的函数被"融合"到同一个任务中，在同一个线程内执行。

source: The functions of the operators are fused into a single task which is executed by a single thread.
zh_cn: 算子里的函数被揉到同一个任务中，在一个线程里执行。

source: The fundamental difference between rebalance() and rescale() lies in the way task connections are formed.
zh_cn: rebalance()和rescale()的本质不同体现在生成任务连接的方式。

source: The fundamental mode of operation - batch processing - is the same regardless whether the architecture is based on a data ware‐ house or components of the Hadoop ecosystem.
zh_cn: 基本操作模式（批处理）对基于数据仓库或Hadoop生态组件的架构，都是都是完全相同。

source: The fused tasks exchange records by method calls and thus with basically no communication costs.
zh_cn: 融合的任务只需通过方法调用就可以进行记录交换，因此几乎没有通信成本。

source: The generated pom.xml file also contains instructions on how to add new dependencies to your project.
zh_cn: 生成的pom.xml文件里还包含一些如何往项目中添加其他依赖的说明。

source: The gen‐ erated folder contains a src/ folder and a pom.xml file.
zh_cn: 生成的文件夹内包含了一个src/目录和一个pom.xml文件。

source: The getKvState() method returns a CompletableFuture[S] where S is the type of the state (e.g., ValueState[_] or MapState[_, _]).
zh_cn: getKvState()方法返回一个CompletableFuture[S]，其中S是状态类型（例如ValueState[_]或MapState[_, _]）。

source: The getter and setter functions must follow the default naming scheme, which is Y getX() and setX(Y x) for a field x of type Y.
zh_cn: 这些方法需要遵循默认的命名规范，即对于Y类型的x字段方法头分别为Y getX()和setX(Y x)。

source: The global() method sends all events of the input data stream to the first paral‐ lel task of the downstream operator.
zh_cn: global()方法会将输入流中的所有事件发往下游算子的第一个并行任务。

source: The goal of this chapter is to introduce the fundamental concepts of stream process‐ ing and the requirements of its frameworks.
zh_cn: 通过本章，我们旨在介绍流处理的基础概念及其处理框架的需求。

source: The heap memory is used for all objects, including the TaskMan‐ ager runtime, operators and functions of the application, and in-flight data.
zh_cn: 堆内存需要供所有对象使用，包括TaskManager运行时，应用的算子和函数，以及处理中的数据。

source: The hostname (or IP address) of the machine that runs the master process needs to be configured in the ./conf/flink-conf.yaml file with the config key jobman ager.rpc.address.
zh_cn: 在./conf/flink-conf.yaml文件中将jobmanager.rpc.address一项配置为主进程所在机器的主机名（或IP地址）。

source: The hostnames (or IP addresses) of all machines that should run TaskManagers need to be listed in the ./conf/slaves file.
zh_cn: 将所有需要运行TaskManager的主机名（或IP地址）列在./conf/slaves文件中。

source: The idea here is to only write those results to an external sink system that have been computed before the last successful checkpoint.
zh_cn: 它的基本思路是只有在上次成功的检查点之前计算的结果才会被写入外部数据汇系统。

source: The iden‐ tifiers are written into a savepoint as metadata with the actual state data of an opera‐ tor.
zh_cn: 该标识会作为元数据和算子的实际状态一起写入保存点。

source: The idle mechanism of sources can be used to address the problem of not advancing watermarks as discussed earlier.
zh_cn: 数据源空闲声明机制可以用来解决上面提到的水位线不向前推进的问题。

source: The image also includes the code to run a JobManager and ResourceManager.
zh_cn: 镜像中还包含着运行JobManager以及ResourceManager的代码。

source: The image can be started in two ways—as a JobMaster con‐ tainer or a TaskManager container.
zh_cn: 该镜像可以以两种方式启动——作为JobMaster容器或TaskManager容器。

source: The implementation details of SensorTimeAssigner
zh_cn: 你现在还无须关心SensorTimeAssigner的实现细节。

source: The implementation of a ReadingFilter function that dynamically filters a stream of sensor readings based on a stream of filter switches is shown in Example 6-9.
zh_cn: 示例6-9给出了ReadingFilter函数的实现，它基于过滤开关流对传感器读数流进行动态过滤。

source: The implementation of the TempIncreaseAlterFunction is shown in Example 6-5.
zh_cn: 示例6-5给出了TempIncreaseAlterFunction的实现。

source: The import steps are similar for most IDEs.
zh_cn: 大多数IDE的导入步骤都很类似，

source: The importance of state becomes even more evident if we consider the case of using a batch processing system to analyze an unbounded data set.
zh_cn: 如果考虑使用批处理系统分析有限数据集的情况，那么状态的重要性就越发明显。

source: The importance of state becomes even more evident if we consider the case of using a batch processing system to analyze an unbounded dataset.
zh_cn: 在使用批处理系统分析有限数据集的情况下，状态的重要性会越发凸显。

source: The individual state backends are described in more detail in “Choosing a State Backend” on page 169.
zh_cn: 我们已经在第169页"选择状态后端"一节对每个状态后端都进行了详细的描述。

source: The ingestion time of an event is the time it entered the stream processor.
zh_cn: 它表示事件进入流处理引擎的时间。

source: The initializeState() method is called when a par‐ allel instance of CheckpointedFunction is created.
zh_cn: initializeState()方法会在创建CheckpointedFunction的并行实例时被调用。

source: The interface defines an input type, IN, an accumulator of type ACC, and a result type OUT.
zh_cn: 该接口定义了输入类型IN，累加器类型ACC以及结果类型OUT。

source: The interface of AsyncFunction is shown in the following:
zh_cn: AsyncFunction接口内容如下所示：

source: The interface pro‐ vides two methods:
zh_cn: ListCheckpointed接口提供了两个方法：

source: The internal Kafka client can be configured to retry writes before declaring them failed by setting the
zh_cn: 你可以通过将重试属性（retries property）设置为一个大于0（0是默认值）的值来配置内部的kafka客户端在宣告写入失败之前重试几次，

source: The interval in milliseconds in which the path is periodically scanned.
zh_cn: 针对目标路径周期性扫描的时间间隔（以毫秒为单位）。

source: The interval is specified in milliseconds.
zh_cn: 间隔以毫秒为单位。

source: The interval join currently only supports event time and operates with INNER JOIN
zh_cn: 基于间隔的Join目前只支持事件时间以及INNER JOIN语义

source: The interval join joins events from two streams that have a common key and that have timestamps not more than specified intervals apart from each other.
zh_cn: 基于间隔的Join会对两条流中拥有相同键值以及彼此之间时间戳不超过某一指定间隔的事件进行Join。

source: The introductory example actually uses a simple KeySelector function in the
zh_cn: 开篇示例其实就是在keyBy()方法中使用了一个简单的KeySelector函数：

source: The io.tmp.dirs parameter is used as the default value for the
zh_cn: io.tmp.dirs参数值路径会默认用于Flink大多数有本地存储需求的组件。

source: The iterator returned by get() returns an Iterable with a single entry, which is
zh_cn: ReducingState.get()方法返回的Iterable对象只有一个条目，即聚合后的值。

source: The job ID of the started application
zh_cn: 应用启动后的作业ID

source: The join in Figure 6-7 stores all records with timestamps larger than the current watermark—15 minutes from stream A—and all records with timestamps larger than the current watermark—one hour from stream B. You should be aware that the storage requirements of the interval join may significantly increase if the event time of both input streams is not synchronized because the watermark is deter‐ mined by the “slower” stream.
zh_cn: 图6-7中的Join需要存储数据流A中所有时间戳大于当前水位线减去15分钟的记录，以及数据流B中所有时间戳大于当前水位线减去1小时的记录。不难想象，如果两条流的事件时间不同步，那么Join所需的存储就会显著增加，因为水位线总是由"较慢"的那条流来决定。

source: The join interval is symmetric, i.e., an event from B joins with all events from A that are no more than 15 minutes earlier and at most one hour later than the B event.
zh_cn: Join间隔具有对称性，因此上面的条件也可以表示为A中事件的时间戳相较B中事件的时间戳不早于15分钟且不晚于1小时。

source: The key and value of the map can be of arbitrary type.
zh_cn: 该映射的键和值可以是任意类型。

source: The key does not necessarily have to be a field of the input event but can be derived using arbitrary computations.
zh_cn: 这个键值不一定非要是输入事件中的一个字段，而是可以经由任意计算得来的。

source: The keyBy transformation converts a DataStream into a KeyedStream by specifying a key.
zh_cn: keyBy转换通过指定键值的方式将一个DataStream转化为KeyedStream。

source: The keyBy() method receives an argument that specifies the key (or keys) to group by and returns a KeyedStream.
zh_cn: keyBy()方法接收一个用来指定分区键值（可以是多个）的参数，返回一个KeyedStream。

source: The keyed state instances of a function are distributed across all parallel tasks of the function’s operator.
zh_cn: 函数的键值分区状态实例会分布在函数所在算子的所有并行任务上。

source: The lambda architecture
zh_cn: Lambda架构

source: The lambda architecture augments the traditional periodic batch processing architec‐ ture with a speed layer that is powered by a low-latency stream processor.
zh_cn: Lambda架构在传统周期性批处理架构的基础上添加了一个由低延迟流处理引擎所驱动的"提速层"（speed layer）。

source: The lambda architecture is no longer state of the art, but is still used in many places.
zh_cn: 虽然Lambda架构已经算不上最先进，但应用仍然非常广泛。

source: The lambda function r => r.id extracts the id field of a sensor reading r.
zh_cn: Lambda函数r => r.id表示从传感器读数r中提取id字段。

source: The lambda reduce function forwards the first tuple field (the key field) and concate‐ nates the List[String] values of the second tuple field.
zh_cn: 用于reduce的Lambda函数会直接转发第一个字段（键值字段），并将所有第二个字段中的List[String]值连接合并起来。

source: The last reading position known by Kafka for the consumer group that was con‐ figured via the group.id parameter.
zh_cn: 通过group.id参数配置的Kafka消费者组所记录的最后读取位置，

source: The latest offset of each individual partition:
zh_cn: 每个分区最晚的偏移：

source: The latter decision is based on a trigger condition.
zh_cn: 其中参与计算的决策会根据触发条件判定，

source: The latter will be replaced at runtime with actual values.
zh_cn: 后者会在运行时被替换成实际的值。

source: The leading Dis‐ patcher recovers the failed application by starting a new JobManager thread that looks up the metadata pointer in ZooKeeper and loads the metadata from the persis‐ tent storage.
zh_cn: 该Dispatcher会启动一个新的JobManager线程来恢复故障应用。新的JobManager会从ZooKeeper中查找元数据的存储路径，并依此从持久化存储中读取元数据。

source: The library style of running Flink applications resembles the deployment of micro‐ services in a containerized environment.
zh_cn: 以库模式运行Flink应用有些类似于容器化环境中的微服务部署。

source: The list entries can be of arbitrary type.
zh_cn: 列表中的条目可以是任意类型。

source: The list includes the internal ID of a JAR file, its original name, and the time when it was uploaded.
zh_cn: 该列表包含了JAR文件的内部ID、其原始名称以及上传时间。

source: The live updated results of a streaming analytics application can be used to power dashboard applications as shown in Figure 1-6.
zh_cn: 如图1-6所示，流式分析应用实时更新的结果可用于支撑仪表盘应用的展示。

source: The live updated results of a streaming analytics applications can be used to power dashboard applications as shown in Figure 1-6.
zh_cn: 如图1-6所示，流式分析应用的实时更新结果可以支撑表盘应用的展示。

source: The logic of an application is defined by chaining transformations.
zh_cn: 应用程序的逻辑是通过一系列转换来定义的。

source: The lower and upper bounds are defined as negative and positive time intervals, for example, as between(Time.hour(-1), Time.minute(15)).
zh_cn: 下界和上界分别由负时间间隔和正时间间隔来定义，例如between(Time.hour(-1), Time.minute(15))。

source: The lower and upper bounds can be arbitrarily chosen as long as the lower bound is smaller than the upper bound; you
zh_cn: 在满足下界值小于上界值的前提下，你可以任意对它们赋值。

source: The main take-away here is that lowering latency actually increases throughput.
zh_cn: 这里的要点就是降低延迟实际上可以提高吞吐。

source: The main takeaway here is that lowering latency increases throughput.
zh_cn: 此处的要点就是：降低延迟实际上可以提高吞吐。

source: The map transformation is specified by calling the DataStream.map() method and produces a new DataStream.
zh_cn: 通过调用DataStream.map()方法可以指定map转换产生一个新的DataStream。

source: The master container is started from the Flink 1.7 Docker image (image: flink: 1.7) with an argument that starts the master process (args: - jobmanager).
zh_cn: 主进程容器从Flink 1.7 Docker镜像（image: flink: 1.7）启动主进程（需要配置参数args: - jobmanager）。

source: The master deployment configuration is shown in Example 9-2.
zh_cn: 示例9-2展示了主进程的Deployment配置。

source: The master process runs a Dispatcher and a ResourceManager in separate threads.
zh_cn: 主进程会启动单独的线程来运行Dispatcher和ResourceManager。

source: The maximum number of application master execution attempts.
zh_cn: ApplicationMaster尝试执行的最大次数。

source: The maximum parallelism parameter of an operator defines the number of key groups into which the keyed state of the operator is split.
zh_cn: 算子的最大并行度参数定义了算子在对键值状态进行分割时所用到的键值组（key group）的数量。

source: The mechanism is similar to buffering techniques used in networking or disk IO pro‐ tocols.
zh_cn: 其机制和网络以及磁盘IO协议中的缓冲技术很像。

source: The mechanism is similar to the buffering techniques used in networking or disk I/O protocols.
zh_cn: 它的机制类似于网络以及磁盘I/O协议中的缓冲技术。

source: The mechanism relies on the ability of a sink to commit a transaction after recovering from a failure that was opened before a completed checkpoint.
zh_cn: 该机制需要数据汇在故障恢复后能够提交在检查点完成前开启的事务。

source: The menu on the left links to more detailed information on jobs and configu‐ ration parameters and also allows job submission by uploading a JAR.
zh_cn: 你可以通过左侧菜单访问作业的详细信息和配置参数页面，还可以上传JAR来提交作业。

source: The metadata of the window typically contains information that can be used
zh_cn: 窗口的元数据通常包含了一些可用作窗口标识的信息，

source: The method clears all state associated with the key, the last temperature and the last timer state.
zh_cn: 该回调方法会清除所有当前键值的状态，包括用于保存最近一次温度以及前一个计时器时间的状态。

source: The method distributes records randomly according to a uniform distribution to the parallel tasks of the following operator.
zh_cn: 该方法会依照均匀分布随机地将记录发往后继算子的并行任务。

source: The method has two parameters, checkpointId, which is a unique, monotonically increasing identifier for checkpoints, and timestamp, which is the wall-clock time when the master initiated the checkpoint.
zh_cn: 它接收两个参数：checkpointId是一个针对检查点的唯一且单调递增的标识，timestamp是JobManager开始创建检查点的机器时间。

source: The method is called with a FunctionInitializationContext object that provides access to an Operator StateStore and a KeyedStateStore object.
zh_cn: Flink在调用该方法时会传入一个FunctionInitializationContext对象，我们可以利用它访问OperatorStateStore及KeyedStateStore对象。

source: The method is called with a list of state objects and has to restore the state of the operator based on these objects.
zh_cn: 该方法接收一个状态对象列表，并需要基于这些对象恢复算子状态。

source: The method must return true if all writes succeeded and false if a write failed.
zh_cn: 它会在全部记录写出成功时返回true，如果失败则会返回false。

source: The method returns the right builder for the data type of the DataStream.
zh_cn: 构建器的类型会和传入的DataStream类型相吻合。

source: The method takes several parameters, such as the JobID of the running application, the state identifier, the key for which the state should be
zh_cn: 该方法需要接收几个参数，例如：当前运行应用的JobID，状态标识符，所需状态的键值，
